---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod2
source: html/9b62cd91-08db-2c32-bc30-dc11021f0c57.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod2 Property

"Young modulus Y"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamYoungMod2 { get; }
```